kLabUM/notoriOS/notoriOS.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "isr_SleepTimer.h"
#include "SleepTimer.h"
#include "Power_VBAT1_aliases.h"
#include "Power_VBAT1.h"
#include "RTC.h"
#include "LED_aliases.h"
#include "LED.h"
#include "Power_VBAT2_aliases.h"
#include "Power_VBAT2.h"
#include "Power_VDD1_aliases.h"
#include "Power_VDD1.h"
#include "Power_VDD2_aliases.h"
#include "Power_VDD2.h"
#include "Clock_IMO.h"
#include "Pressure_Voltage_Enable_aliases.h"
#include "Pressure_Voltage_Enable.h"
#include "AN_VSOL_aliases.h"
#include "AN_VSOL.h"
#include "Level_Sensor_UART.h"
#include "Level_Sensor_RX_aliases.h"
#include "Level_Sensor_RX.h"
#include "Level_Sensor_ISR.h"
#include "Level_Sensor_Power_aliases.h"
#include "Level_Sensor_Power.h"
#include "emFile.h"
#include "SD_Card_Power_aliases.h"
#include "SD_Card_Power.h"
#include "SD_Chip_Detect_aliases.h"
#include "SD_Chip_Detect.h"
#include "AMux.h"
#include "ADC.h"
#include "Battery_Voltage_Enable_aliases.h"
#include "Battery_Voltage_Enable.h"
#include "AN_VBAT_aliases.h"
#include "AN_VBAT.h"
#include "Debug_UART.h"
#include "Debug_TX_aliases.h"
#include "Debug_TX.h"
#include "Pin_Telit_ONOFF_aliases.h"
#include "Pin_Telit_ONOFF.h"
#include "Pin_Telit_pwr_aliases.h"
#include "Pin_Telit_pwr.h"
#include "Pin_Telit_SWRDY_aliases.h"
#include "Pin_Telit_SWRDY.h"
#include "UART_Telit.h"
#include "Rx_Telit_aliases.h"
#include "Rx_Telit.h"
#include "Tx_Telit_aliases.h"
#include "Tx_Telit.h"
#include "isr_telit_rx.h"
#include "Telit_ControlReg.h"
#include "AN_PRTRANS_aliases.h"
#include "AN_PRTRANS.h"
#include "Valve_POS_Power_aliases.h"
#include "Valve_POS_Power.h"
#include "Valve_POS_reading_aliases.h"
#include "Valve_POS_reading.h"
#include "Downstream_Level_Sensor_UART.h"
#include "Downstream_Level_Sensor_RX_aliases.h"
#include "Downstream_Level_Sensor_RX.h"
#include "Downstream_Level_Sensor_ISR.h"
#include "Downstream_Level_Sensor_Power_aliases.h"
#include "Downstream_Level_Sensor_Power.h"
#include "Downstream_Clock_IMO.h"
#include "emFile_SPI0.h"
#include "emFile_SPI0_PVT.h"
#include "emFile_mosi0_aliases.h"
#include "emFile_mosi0.h"
#include "emFile_Clock_1.h"
#include "emFile_miso0_aliases.h"
#include "emFile_miso0.h"
#include "emFile_sclk0_aliases.h"
#include "emFile_sclk0.h"
#include "emFile_SPI0_CS_aliases.h"
#include "emFile_SPI0_CS.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "Debug_UART_IntClock.h"
#include "UART_Telit_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

